---
title: Revolution
classe: Autodesk.Revit.DB.Revolution
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GenericForm
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# Revolution

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ModelLine Axis { get; }` | `revolution.Axis` | ModelLine |
| `Double EndAngle { get; set; }` | `revolution.EndAngle` | Double |
| `Sketch Sketch { get; }` | `revolution.Sketch` | Sketch |
| `Double StartAngle { get; set; }` | `revolution.StartAngle` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```